{"config": [{"config": {"cropping": [[60, 20], [0, 0]], "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "name": "cropping2d_1"}, "class_name": "Cropping2D"}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>B\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 80, 320, 3], "function_type": "lambda", "output_shape_type": "raw", "output_shape": [80, 320, 3], "arguments": {}, "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"nb_col": 3, "trainable": true, "batch_input_shape": [null, 80, 320, 3], "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 32, "W_regularizer": null, "nb_row": 3, "name": "convolution2d_1", "b_regularizer": null, "input_dtype": "float32", "activation": "linear", "activity_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 32, "W_regularizer": null, "name": "convolution2d_2", "nb_row": 3, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 64, "W_regularizer": null, "name": "convolution2d_3", "nb_row": 3, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias": true, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "input_dim": 19456, "name": "dense_1", "b_regularizer": null, "activation": "linear", "W_regularizer": null, "b_constraint": null, "output_dim": 64}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias": true, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "input_dim": 64, "name": "dense_2", "b_regularizer": null, "activation": "relu", "W_regularizer": null, "b_constraint": null, "output_dim": 16}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.1, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias": true, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "input_dim": 16, "name": "dense_3", "b_regularizer": null, "activation": "linear", "W_regularizer": null, "b_constraint": null, "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}